In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
df1 = DataFrame({'age':[18,22,33],'height':[170,175,180]})
df2 = DataFrame({'age':[18,23,31],'weight':[170,175,180]})

In [4]:
pd.merge(df1,df2)

   age  height  weight
0   18     170     170

In [5]:
pd.merge(df1,df2,how='outer')

   age  height  weight
0   18   170.0   170.0
1   22   175.0     NaN
2   33   180.0     NaN
3   23     NaN   175.0
4   31     NaN   180.0

In [6]:
pd.merge(df1,df2,how='left')

   age  height  weight
0   18     170   170.0
1   22     175     NaN
2   33     180     NaN

In [7]:
pd.merge(df1,df2,how='right')

   age  height  weight
0   18   170.0     170
1   23     NaN     175
2   31     NaN     180

In [14]:
df2.age = [18,22,33]
df2.columns = ['age','height']
display(df1,df2)

   age  height
0   18     170
1   22     175
2   33     180

   age  height
0   18     170
1   22     175
2   33     180

In [15]:
pd.merge(df1,df2,on='age',suffixes=['_A','_B'])

   age  height_A  height_B
0   18       170       170
1   22       175       175
2   33       180       180

# 美国各区人口数据分析

In [19]:
s_abb = pd.read_csv('data/state-abbrevs.csv')
s_abb.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [20]:
s_ares = pd.read_csv('data/state-areas.csv')
s_ares.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [21]:
s_pop = pd.read_csv('data/state-population.csv')
s_pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [24]:
pd.merge(s_abb,s_pop,left_on=s_abb.state,right_on=s_pop.ages).head()

Empty DataFrame
Columns: [key_0, state, abbreviation, state/region, ages, year, population]
Index: []